[
  {
    "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
    "author": "Стив Макконнелл"
  },
  {
    "text": "Сложность программы растет до тех пор, пока не превысит способности программиста",
    "author": "Артур Блох. Законы Мэрфи"
  },
  {
    "text": "Ходить по воде и разрабатывать программы, следуя ТЗ, очень просто… если они заморожены",
    "author": "И. Берард"
  },
  {
    "text": "Программирование сегодня — это гонка разработчиков программ, стремящихся писать программы с большей и лучшей идиотоустойчивостью, и вселенной, которая пытается создать больше отборных идиотов. Пока вселенная побеждает.",
    "author": "Рик Кук"
  },
  {
    "text": "Низкоуровневый язык — это когда требуется внимание к вещам, которые никак не связаны с программами на этом языке.",
    "author": "Алан Перлис"
  },
  {
    "text": "Программирование на С похоже на быстрые танцы на только что отполированном полу людей с острыми бритвами в руках",
    "author": "Валди Равенс"
  },
  {
    "text": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили.",
    "author": "Закон Мошера"
  },
  {
    "text": "В хорошем дизайне добавление чего-то стоит дешевле, чем сама эта вещь.",
    "author": "Томас Гейл"
  },
  {
    "text": "В теории, теория и практика неразделимы. На практике это не так.",
    "author": "Йогги Берра"
  },
  {
    "text": "Я изобрел понятие «объектно-ориентированный», и могу заявить, что не имел в виду C++.",
    "author": "Алан Кей"
  },
  {
    "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
    "author": "Кристофер Томпсон"
  },
  {
    "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
    "author": "Билл Гейтс"
  },
  {
    "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
    "author": "Ларри Волл"
  },
  {
    "text": "Большинство программ на сегодняшний день подобны египетским пирамидам из миллиона кирпичиков друг на друге и без конструктивной целостности — они просто построены грубой силой и тысячами рабов.",
    "author": "Алан Кей"
  },
  {
    "text": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования.",
    "author": "Линус Торвальдс"
  },
  {
    "text": "Люди, которые думают, что ненавидят компьютеры, на самом деле ненавидят плохих программистов.",
    "author": "Ларри Найвен"
  },
  {
    "text": "Если вы дадите человеку программу, то займете его на один день. Если вы научите человека программировать, то займете его на всю жизнь.",
    "author": "Вазеем Латиф"
  },
  {
    "text": "Мы наблюдаем общество, которое все больше зависит от машин, но при этом использует их все неэффективнее.",
    "author": "Дуглас Рушкофф"
  },
  {
    "text": "Иногда лучшие программы создаются на бумажке. Запрограммировать их — второстепенная вещь",
    "author": "Макс Канат-Александр"
  },
  {
    "text": "Отладка кода — это как охота. Охота на баги.",
    "author": "Амит Калантри"
  },
  {
    "text": "Любой дурак сможет написать код, который поймет машина. Хорошие программисты пишут код, который сможет понять человек.",
    "author": "Мартин Фоулер"
  },
  {
    "text": "Программирование — это разбиение чего-то большого и невозможного на что-то маленькое и вполне реальное.",
    "author": "Jazzwant"
  },
  {
    "text": "Программисты — не математики, как бы нам этого ни хотелось.",
    "author": "Ричард Габриель"
  },
  {
    "text": "Простота — залог надежности.",
    "author": "Эдсгер Вибе Дейкстра"
  },
  {
    "text": "Работает? Не трогай.",
    "author": "Любой программист"
  },
  {
    "text": "При помощи C вы легко можете выстрелить себе в ногу. При помощи C++ это сделать сложнее, но если это произойдёт, вам оторвёт всю ногу целиком.",
    "author": "Бьёрн Страуструп"
  },
  {
    "text": "Последние нововведения в C++ были созданы, чтобы исправить предыдущие нововведения.",
    "author": "Дэвид Джеймисон"
  },
  {
    "text": "Java — это C++, из которого убрали все пистолеты, ножи и дубинки.",
    "author": "Джеймс Гослинг"
  },
  {
    "text": "Молодые специалисты не умеют работать, а опытные специалисты умеют не работать.",
    "author": "Александр Голов"
  },
  {
    "text": "Чтобы написать чистый код, мы сначала пишем грязный код, а затем рефакторим его.",
    "author": "Роберт Мартин"
  },
  {
    "text": "Некоторые люди во время решения некой проблемы думают: «Почему бы мне не использовать регулярные выражения?». После этого у них уже две проблемы…",
    "author": "Джейми Завински"
  },
  {
    "text": "Думаю, это будет новой фичей. Только не говорите никому, что она возникла случайно.",
    "author": "Ларри Волл"
  },
  {
    "text": "640 Кб должно хватить для любых задач.",
    "author": "Билл Гейтс"
  },
  {
    "text": "В жизни каждого бывают моменты, когда следует броситься в пропасть, чтобы наконец убедиться в том, что всегда умел летать...",
    "author": "Макс Фрай"
  },
  {
    "text": "Лучше научиться поздно, чем никогда.",
    "author": "Эзоп"
  },
  {
    "text": "Никогда не поздно стать тем, кем тебе хочется быть.",
    "author": "Джордж Элиот"
  },
  {
    "text": "Не думай, что ты умнее других, хотя другие и считают, что умнее тебя, — и в этом твое преимущество перед ними.",
    "author": "Уилльям Блейк"
  },
  {
    "text": "Благоразумен тот, кто не печалится о том, чего не имеет, и, напротив, рад тому, что имеет.",
    "author": "Демокрит"
  },
  {
    "text": "Проблема дается нам не для жалоб, а для решения.",
    "author": "Р. Хен"
  },
  {
    "text": "Невозможно прожить великую жизнь, если она бессмысленна. И очень трудно найти смысл жизни, имея бессмысленную работу.",
    "author": "Автор неизвестен"
  },
  {
    "text": "Размышляйте неторопливо, но действуйте решительно, уступайте великодушно, а сопротивляйтесь твердо.",
    "author": "Чарльз Колтон"
  },
  {
    "text": "Это откудова это к нам такого красивого дяденьку замело?",
    "author": "Надежда Кузякина"
  },
  {
    "text": "Извините, что помешал вам деньги прятать.",
    "author": "Дядя Митя"
  },
  {
    "text": "Брак — это добровольное рабство.",
    "author": "Дядя Митя"
  },
  {
    "text": "У всех трудящихся два выходных дня в неделю. Мы, цари, работаем без выходных.",
    "author": "Иван Васильевич меняет профессию"
  },
  {
    "text": "Нельзя социофобам в лицо говорить, что они социофобы — у них от этого социофобия!",
    "author": "Теория большого взрыва"
  },
  {
    "text": "А может, вам еще ключ от квартиры, где деньги лежат?",
    "author": "12 стульев"
  },
  {
    "text": "Главная проблема цитат в интернете в том, что люди сразу верят в их подлинность.",
    "author": "Иосиф Сталин"
  }
]